sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_spi.c
    if (!((tmp_state == HAL_SPI_STATE_READY) || \
            ((tmp_mode == SPI_MODE_MASTER) && (hspi->Init.Direction == SPI_DIRECTION_2LINES) && (tmp_state == HAL_SPI_STATE_BUSY_RX))))
    {
        errorcode = HAL_BUSY;
        goto error;
    }

    if ((pTxData == NULL) || (pRxData == NULL) || (Size == 0U))
    {
        errorcode = HAL_ERROR;
        goto error;
    }

    /* Don't overwrite in case of HAL_SPI_STATE_BUSY_RX */
    if (hspi->State != HAL_SPI_STATE_BUSY_RX)
    {
        hspi->State = HAL_SPI_STATE_BUSY_TX_RX;
    }

    /* Set the transaction information */
    hspi->ErrorCode   = HAL_SPI_ERROR_NONE;
    hspi->pRxBuffPtr  = (uint8_t *)pRxData;
    hspi->RxXferCount = Size;
    hspi->RxXferSize  = Size;
    hspi->pTxBuffPtr  = (uint8_t *)pTxData;
    hspi->TxXferCount = Size;
    hspi->TxXferSize  = Size;

    /*Init field not used in handle to zero */
    hspi->RxISR       = NULL;
    hspi->TxISR       = NULL;

#if (USE_SPI_CRC != 0U)
    /* Reset CRC Calculation */
    if (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLE)
    {
        SPI_RESET_CRC(hspi);
    }
#endif /* USE_SPI_CRC */

    /* Set the Rx Fifo threshold */
    if ((hspi->Init.DataSize > SPI_DATASIZE_8BIT) || (initial_RxXferCount > 1U))
    {
        /* Set fiforxthreshold according the reception data length: 16bit */
        CLEAR_BIT(hspi->Instance->CR2, SPI_RXFIFO_THRESHOLD);
    }
    else
    {
        /* Set fiforxthreshold according the reception data length: 8bit */
        SET_BIT(hspi->Instance->CR2, SPI_RXFIFO_THRESHOLD);
    }

    /* Check if the SPI is already enabled */
    if ((hspi->Instance->CR1 & SPI_CR1_SPE) != SPI_CR1_SPE)
    {
        /* Enable SPI peripheral */
        __HAL_SPI_ENABLE(hspi);
    }

    /* Transmit and Receive data in 16 Bit mode */
    if (hspi->Init.DataSize > SPI_DATASIZE_8BIT)
    {
        if ((hspi->Init.Mode == SPI_MODE_SLAVE) || (initial_TxXferCount == 0x01U))
        {
            hspi->Instance->DR = *((uint16_t *)hspi->pTxBuffPtr);
            hspi->pTxBuffPtr += sizeof(uint16_t);
            hspi->TxXferCount--;
        }
        while ((hspi->TxXferCount > 0U) || (hspi->RxXferCount > 0U))
        {
            /* Check TXE flag */
            if ((__HAL_SPI_GET_FLAG(hspi, SPI_FLAG_TXE)) && (hspi->TxXferCount > 0U) && (txallowed == 1U))
            {
                hspi->Instance->DR = *((uint16_t *)hspi->pTxBuffPtr);
                hspi->pTxBuffPtr += sizeof(uint16_t);
                hspi->TxXferCount--;
                /* Next Data is a reception (Rx). Tx not allowed */
                txallowed = 0U;

#if (USE_SPI_CRC != 0U)
                /* Enable CRC Transmission */
                if ((hspi->TxXferCount == 0U) && (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLE))
                {
                    /* Set NSS Soft to received correctly the CRC on slave mode with NSS pulse activated */
                    if ((READ_BIT(spi_cr1, SPI_CR1_MSTR) == 0U) && (READ_BIT(spi_cr2, SPI_CR2_NSSP) == SPI_CR2_NSSP))
                    {
                        SET_BIT(hspi->Instance->CR1, SPI_CR1_SSM);
                    }
                    SET_BIT(hspi->Instance->CR1, SPI_CR1_CRCNEXT);
                }
#endif /* USE_SPI_CRC */
            }

            /* Check RXNE flag */
            if ((__HAL_SPI_GET_FLAG(hspi, SPI_FLAG_RXNE)) && (hspi->RxXferCount > 0U))
            {
                *((uint16_t *)hspi->pRxBuffPtr) = (uint16_t)hspi->Instance->DR;
                hspi->pRxBuffPtr += sizeof(uint16_t);
                hspi->RxXferCount--;
                /* Next Data is a Transmission (Tx). Tx is allowed */
                txallowed = 1U;
            }
            if (((HAL_GetTick() - tickstart) >=  Timeout) && (Timeout != HAL_MAX_DELAY))
            {
                errorcode = HAL_TIMEOUT;
                goto error;
            }
        }
    }
    /* Transmit and Receive data in 8 Bit mode */
    else
    {
        if ((hspi->Init.Mode == SPI_MODE_SLAVE) || (initial_TxXferCount == 0x01U))
        {
            if (hspi->TxXferCount > 1U)
            {
                hspi->Instance->DR = *((uint16_t *)hspi->pTxBuffPtr);
                hspi->pTxBuffPtr += sizeof(uint16_t);
                hspi->TxXferCount -= 2U;
            }
            else
            {
                *(__IO uint8_t *)&hspi->Instance->DR = (*hspi->pTxBuffPtr);
                hspi->pTxBuffPtr++;
                hspi->TxXferCount--;
            }
        }
        while ((hspi->TxXferCount > 0U) || (hspi->RxXferCount > 0U))
        {
            /* Check TXE flag */
            if ((__HAL_SPI_GET_FLAG(hspi, SPI_FLAG_TXE)) && (hspi->TxXferCount > 0U) && (txallowed == 1U))
            {
                if (hspi->TxXferCount > 1U)
                {
                    hspi->Instance->DR = *((uint16_t *)hspi->pTxBuffPtr);
                    hspi->pTxBuffPtr += sizeof(uint16_t);
                    hspi->TxXferCount -= 2U;
                }
                else
                {
                    *(__IO uint8_t *)&hspi->Instance->DR = (*hspi->pTxBuffPtr);
                    hspi->pTxBuffPtr++;
                    hspi->TxXferCount--;
                }
                /* Next Data is a reception (Rx). Tx not allowed */
                txallowed = 0U;

#if (USE_SPI_CRC != 0U)
                /* Enable CRC Transmission */
                if ((hspi->TxXferCount == 0U) && (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLE))
                {
                    /* Set NSS Soft to received correctly the CRC on slave mode with NSS pulse activated */
                    if ((READ_BIT(spi_cr1, SPI_CR1_MSTR) == 0U) && (READ_BIT(spi_cr2, SPI_CR2_NSSP) == SPI_CR2_NSSP))
                    {
                        SET_BIT(hspi->Instance->CR1, SPI_CR1_SSM);
                    }
                    SET_BIT(hspi->Instance->CR1, SPI_CR1_CRCNEXT);
                }
#endif /* USE_SPI_CRC */
            }

            /* Wait until RXNE flag is reset */
            if ((__HAL_SPI_GET_FLAG(hspi, SPI_FLAG_RXNE)) && (hspi->RxXferCount > 0U))
            {
                if (hspi->RxXferCount > 1U)
                {
                    *((uint16_t *)hspi->pRxBuffPtr) = (uint16_t)hspi->Instance->DR;
                    hspi->pRxBuffPtr += sizeof(uint16_t);
                    hspi->RxXferCount -= 2U;
                    if (hspi->RxXferCount <= 1U)
                    {
                        /* Set RX Fifo threshold before to switch on 8 bit data size */
                        SET_BIT(hspi->Instance->CR2, SPI_RXFIFO_THRESHOLD);
                    }
                }
                else
                {
                    (*(uint8_t *)hspi->pRxBuffPtr) = *(__IO uint8_t *)&hspi->Instance->DR;
                    hspi->pRxBuffPtr++;
                    hspi->RxXferCount--;
                }
                /* Next Data is a Transmission (Tx). Tx is allowed */
                txallowed = 1U;
            }
            if ((((HAL_GetTick() - tickstart) >=  Timeout) && ((Timeout != HAL_MAX_DELAY))) || (Timeout == 0U))
            {
                errorcode = HAL_TIMEOUT;
                goto error;
            }
        }
    }

#if (USE_SPI_CRC != 0U)
    /* Read CRC from DR to close CRC calculation process */
    if (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLE)
    {
        /* Wait until TXE flag */
        if (SPI_WaitFlagStateUntilTimeout(hspi, SPI_FLAG_RXNE, SET, Timeout, tickstart) != HAL_OK)
        {
            /* Error on the CRC reception */
            SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_CRC);
            errorcode = HAL_TIMEOUT;
            goto error;
        }
        /* Read CRC */
        if (hspi->Init.DataSize == SPI_DATASIZE_16BIT)
        {
            /* Read 16bit CRC */
            READ_REG(hspi->Instance->DR);
        }
        else
        {
            /* Read 8bit CRC */
            READ_REG(*(__IO uint8_t *)&hspi->Instance->DR);

