sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_spi.c
            if (hspi->Init.CRCLength == SPI_CRC_LENGTH_16BIT)
            {
                if (SPI_WaitFlagStateUntilTimeout(hspi, SPI_FLAG_RXNE, SET, Timeout, tickstart) != HAL_OK)
                {
                    /* Error on the CRC reception */
                    SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_CRC);
                    errorcode = HAL_TIMEOUT;
                    goto error;
                }
                /* Read 8bit CRC again in case of 16bit CRC in 8bit Data mode */
                READ_REG(*(__IO uint8_t *)&hspi->Instance->DR);
            }
        }
    }

    /* Check if CRC error occurred */
    if (__HAL_SPI_GET_FLAG(hspi, SPI_FLAG_CRCERR))
    {
        SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_CRC);
        /* Clear CRC Flag */
        __HAL_SPI_CLEAR_CRCERRFLAG(hspi);

        errorcode = HAL_ERROR;
    }
#endif /* USE_SPI_CRC */

    /* Check the end of the transaction */
    if (SPI_EndRxTxTransaction(hspi, Timeout, tickstart) != HAL_OK)
    {
        errorcode = HAL_ERROR;
        hspi->ErrorCode = HAL_SPI_ERROR_FLAG;
    }

error :
    hspi->State = HAL_SPI_STATE_READY;
    __HAL_UNLOCK(hspi);
    return errorcode;
}

/**
  * @brief  Transmit an amount of data in non-blocking mode with Interrupt.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @param  pData pointer to data buffer
  * @param  Size amount of data to be sent
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SPI_Transmit_IT(SPI_HandleTypeDef *hspi, uint8_t *pData, uint16_t Size)
{
    HAL_StatusTypeDef errorcode = HAL_OK;

    if ((hspi->Init.DataSize > SPI_DATASIZE_8BIT) || ((hspi->Init.DataSize <= SPI_DATASIZE_8BIT) && (Size > 1U)))
    {
        /* in this case, 16-bit access is performed on Data
           So, check Data is 16-bit aligned address */
        assert_param(IS_SPI_16BIT_ALIGNED_ADDRESS(pData));
    }

    /* Check Direction parameter */
    assert_param(IS_SPI_DIRECTION_2LINES_OR_1LINE(hspi->Init.Direction));

    /* Process Locked */
    __HAL_LOCK(hspi);

    if ((pData == NULL) || (Size == 0U))
    {
        errorcode = HAL_ERROR;
        goto error;
    }

    if (hspi->State != HAL_SPI_STATE_READY)
    {
        errorcode = HAL_BUSY;
        goto error;
    }

    /* Set the transaction information */
    hspi->State       = HAL_SPI_STATE_BUSY_TX;
    hspi->ErrorCode   = HAL_SPI_ERROR_NONE;
    hspi->pTxBuffPtr  = (uint8_t *)pData;
    hspi->TxXferSize  = Size;
    hspi->TxXferCount = Size;

    /* Init field not used in handle to zero */
    hspi->pRxBuffPtr  = (uint8_t *)NULL;
    hspi->RxXferSize  = 0U;
    hspi->RxXferCount = 0U;
    hspi->RxISR       = NULL;

    /* Set the function for IT treatment */
    if (hspi->Init.DataSize > SPI_DATASIZE_8BIT)
    {
        hspi->TxISR = SPI_TxISR_16BIT;
    }
    else
    {
        hspi->TxISR = SPI_TxISR_8BIT;
    }

    /* Configure communication direction : 1Line */
    if (hspi->Init.Direction == SPI_DIRECTION_1LINE)
    {
        SPI_1LINE_TX(hspi);
    }

#if (USE_SPI_CRC != 0U)
    /* Reset CRC Calculation */
    if (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLE)
    {
        SPI_RESET_CRC(hspi);
    }
#endif /* USE_SPI_CRC */

    /* Enable TXE and ERR interrupt */
    __HAL_SPI_ENABLE_IT(hspi, (SPI_IT_TXE | SPI_IT_ERR));


    /* Check if the SPI is already enabled */
    if ((hspi->Instance->CR1 & SPI_CR1_SPE) != SPI_CR1_SPE)
    {
        /* Enable SPI peripheral */
        __HAL_SPI_ENABLE(hspi);
    }

error :
    __HAL_UNLOCK(hspi);
    return errorcode;
}

/**
  * @brief  Receive an amount of data in non-blocking mode with Interrupt.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @param  pData pointer to data buffer
  * @param  Size amount of data to be sent
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SPI_Receive_IT(SPI_HandleTypeDef *hspi, uint8_t *pData, uint16_t Size)
{
    HAL_StatusTypeDef errorcode = HAL_OK;

    if ((hspi->Init.DataSize > SPI_DATASIZE_8BIT) || ((hspi->Init.DataSize <= SPI_DATASIZE_8BIT) && (Size > 1U)))
    {
        /* in this case, 16-bit access is performed on Data
           So, check Data is 16-bit aligned address */
        assert_param(IS_SPI_16BIT_ALIGNED_ADDRESS(pData));
    }

    if ((hspi->Init.Direction == SPI_DIRECTION_2LINES) && (hspi->Init.Mode == SPI_MODE_MASTER))
    {
        hspi->State = HAL_SPI_STATE_BUSY_RX;
        /* Call transmit-receive function to send Dummy data on Tx line and generate clock on CLK line */
        return HAL_SPI_TransmitReceive_IT(hspi, pData, pData, Size);
    }

    /* Process Locked */
    __HAL_LOCK(hspi);

    if (hspi->State != HAL_SPI_STATE_READY)
    {
        errorcode = HAL_BUSY;
        goto error;
    }

    if ((pData == NULL) || (Size == 0U))
    {
        errorcode = HAL_ERROR;
        goto error;
    }

    /* Set the transaction information */
    hspi->State       = HAL_SPI_STATE_BUSY_RX;
    hspi->ErrorCode   = HAL_SPI_ERROR_NONE;
    hspi->pRxBuffPtr  = (uint8_t *)pData;
    hspi->RxXferSize  = Size;
    hspi->RxXferCount = Size;

    /* Init field not used in handle to zero */
    hspi->pTxBuffPtr  = (uint8_t *)NULL;
    hspi->TxXferSize  = 0U;
    hspi->TxXferCount = 0U;
    hspi->TxISR       = NULL;

    /* Check the data size to adapt Rx threshold and the set the function for IT treatment */
    if (hspi->Init.DataSize > SPI_DATASIZE_8BIT)
    {
        /* Set RX Fifo threshold according the reception data length: 16 bit */
        CLEAR_BIT(hspi->Instance->CR2, SPI_RXFIFO_THRESHOLD);
        hspi->RxISR = SPI_RxISR_16BIT;
    }
    else
    {
        /* Set RX Fifo threshold according the reception data length: 8 bit */
        SET_BIT(hspi->Instance->CR2, SPI_RXFIFO_THRESHOLD);
        hspi->RxISR = SPI_RxISR_8BIT;
    }

    /* Configure communication direction : 1Line */
    if (hspi->Init.Direction == SPI_DIRECTION_1LINE)
    {
        SPI_1LINE_RX(hspi);
    }

#if (USE_SPI_CRC != 0U)
    /* Reset CRC Calculation */
    if (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLE)
    {
        hspi->CRCSize = 1U;
        if ((hspi->Init.DataSize <= SPI_DATASIZE_8BIT) && (hspi->Init.CRCLength == SPI_CRC_LENGTH_16BIT))
        {
            hspi->CRCSize = 2U;
        }
        SPI_RESET_CRC(hspi);
    }
    else
    {
        hspi->CRCSize = 0U;
    }
#endif /* USE_SPI_CRC */

    /* Enable TXE and ERR interrupt */
    __HAL_SPI_ENABLE_IT(hspi, (SPI_IT_RXNE | SPI_IT_ERR));

    /* Note : The SPI must be enabled after unlocking current process
              to avoid the risk of SPI interrupt handle execution before current
              process unlock */

    /* Check if the SPI is already enabled */
    if ((hspi->Instance->CR1 & SPI_CR1_SPE) != SPI_CR1_SPE)
    {
        /* Enable SPI peripheral */
        __HAL_SPI_ENABLE(hspi);
    }

error :
    /* Process Unlocked */
    __HAL_UNLOCK(hspi);
    return errorcode;
}

/**
  * @brief  Transmit and Receive an amount of data in non-blocking mode with Interrupt.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @param  pTxData pointer to transmission data buffer
  * @param  pRxData pointer to reception data buffer
  * @param  Size amount of data to be sent and received
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SPI_TransmitReceive_IT(SPI_HandleTypeDef *hspi, uint8_t *pTxData, uint8_t *pRxData, uint16_t Size)
{
    uint32_t             tmp_mode;
    HAL_SPI_StateTypeDef tmp_state;
    HAL_StatusTypeDef    errorcode = HAL_OK;

    if ((hspi->Init.DataSize > SPI_DATASIZE_8BIT) || ((hspi->Init.DataSize <= SPI_DATASIZE_8BIT) && (Size > 1U)))
    {
        /* in this case, 16-bit access is performed on Data
           So, check Data is 16-bit aligned address */
        assert_param(IS_SPI_16BIT_ALIGNED_ADDRESS(pTxData));
        assert_param(IS_SPI_16BIT_ALIGNED_ADDRESS(pRxData));
    }

    /* Check Direction parameter */
    assert_param(IS_SPI_DIRECTION_2LINES(hspi->Init.Direction));

    /* Process locked */
    __HAL_LOCK(hspi);

    /* Init temporary variables */
    tmp_state           = hspi->State;
    tmp_mode            = hspi->Init.Mode;

