sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_spi.c
        /* Call transmit-receive function to send Dummy data on Tx line and generate clock on CLK line */
        return HAL_SPI_TransmitReceive_DMA(hspi, pData, pData, Size);
    }

    /* Process Locked */
    __HAL_LOCK(hspi);

    if (hspi->State != HAL_SPI_STATE_READY)
    {
        errorcode = HAL_BUSY;
        goto error;
    }

    if ((pData == NULL) || (Size == 0U))
    {
        errorcode = HAL_ERROR;
        goto error;
    }

    /* Set the transaction information */
    hspi->State       = HAL_SPI_STATE_BUSY_RX;
    hspi->ErrorCode   = HAL_SPI_ERROR_NONE;
    hspi->pRxBuffPtr  = (uint8_t *)pData;
    hspi->RxXferSize  = Size;
    hspi->RxXferCount = Size;

    /*Init field not used in handle to zero */
    hspi->RxISR       = NULL;
    hspi->TxISR       = NULL;
    hspi->TxXferSize  = 0U;
    hspi->TxXferCount = 0U;

    /* Configure communication direction : 1Line */
    if (hspi->Init.Direction == SPI_DIRECTION_1LINE)
    {
        SPI_1LINE_RX(hspi);
    }

#if (USE_SPI_CRC != 0U)
    /* Reset CRC Calculation */
    if (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLE)
    {
        SPI_RESET_CRC(hspi);
    }
#endif /* USE_SPI_CRC */


//  CLEAR_BIT(hspi->Instance->CR2, SPI_CR2_LDMARX);
    if (hspi->Init.DataSize > SPI_DATASIZE_8BIT)
    {
        /* Set RX Fifo threshold according the reception data length: 16bit */
        CLEAR_BIT(hspi->Instance->CR2, SPI_RXFIFO_THRESHOLD);
    }
    else
    {
        /* Set RX Fifo threshold according the reception data length: 8bit */
        SET_BIT(hspi->Instance->CR2, SPI_RXFIFO_THRESHOLD);

        if (hspi->hdmarx->Init.MemDataAlignment == DMA_MDATAALIGN_HALFWORD)
        {
            /* Set RX Fifo threshold according the reception data length: 16bit */
            CLEAR_BIT(hspi->Instance->CR2, SPI_RXFIFO_THRESHOLD);

            if ((hspi->RxXferCount & 0x1U) == 0x0U)
            {
//        CLEAR_BIT(hspi->Instance->CR2, SPI_CR2_LDMARX);
                hspi->RxXferCount = hspi->RxXferCount >> 1U;
            }
            else
            {
//        SET_BIT(hspi->Instance->CR2, SPI_CR2_LDMARX);
                hspi->RxXferCount = (hspi->RxXferCount >> 1U) + 1U;
            }
        }
    }

    /* Set the SPI RxDMA Half transfer complete callback */
    hspi->hdmarx->XferHalfCpltCallback = SPI_DMAHalfReceiveCplt;

    /* Set the SPI Rx DMA transfer complete callback */
    hspi->hdmarx->XferCpltCallback = SPI_DMAReceiveCplt;

    /* Set the DMA error callback */
    hspi->hdmarx->XferErrorCallback = SPI_DMAError;

    /* Set the DMA AbortCpltCallback */
    hspi->hdmarx->XferAbortCallback = NULL;

    /* Enable the Rx DMA Stream/Channel  */
    if (HAL_OK != HAL_DMA_Start_IT(hspi->hdmarx, (uint32_t)&hspi->Instance->DR, (uint32_t)hspi->pRxBuffPtr,
                                   hspi->RxXferCount))
    {
        /* Update SPI error code */
        SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_DMA);
        errorcode = HAL_ERROR;

        hspi->State = HAL_SPI_STATE_READY;
        goto error;
    }

    /* Check if the SPI is already enabled */
    if ((hspi->Instance->CR1 & SPI_CR1_SPE) != SPI_CR1_SPE)
    {
        /* Enable SPI peripheral */
        __HAL_SPI_ENABLE(hspi);
    }

    /* Enable the SPI Error Interrupt Bit */
    __HAL_SPI_ENABLE_IT(hspi, (SPI_IT_ERR));

    /* Enable Rx DMA Request */
    SET_BIT(hspi->Instance->CR2, SPI_CR2_RXDMAEN);

error:
    /* Process Unlocked */
    __HAL_UNLOCK(hspi);
    return errorcode;
}

/**
  * @brief  Transmit and Receive an amount of data in non-blocking mode with DMA.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @param  pTxData pointer to transmission data buffer
  * @param  pRxData pointer to reception data buffer
  * @note   When the CRC feature is enabled the pRxData Length must be Size + 1
  * @param  Size amount of data to be sent
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SPI_TransmitReceive_DMA(SPI_HandleTypeDef *hspi, uint8_t *pTxData, uint8_t *pRxData,
        uint16_t Size)
{
    uint32_t             tmp_mode;
    HAL_SPI_StateTypeDef tmp_state;
    HAL_StatusTypeDef errorcode = HAL_OK;

    /* Check rx & tx dma handles */
    assert_param(IS_SPI_DMA_HANDLE(hspi->hdmarx));
    assert_param(IS_SPI_DMA_HANDLE(hspi->hdmatx));

    /* Check Direction parameter */
    assert_param(IS_SPI_DIRECTION_2LINES(hspi->Init.Direction));

    /* Process locked */
    __HAL_LOCK(hspi);

    /* Init temporary variables */
    tmp_state           = hspi->State;
    tmp_mode            = hspi->Init.Mode;

    if (!((tmp_state == HAL_SPI_STATE_READY) ||
            ((tmp_mode == SPI_MODE_MASTER) && (hspi->Init.Direction == SPI_DIRECTION_2LINES) && (tmp_state == HAL_SPI_STATE_BUSY_RX))))
    {
        errorcode = HAL_BUSY;
        goto error;
    }

    if ((pTxData == NULL) || (pRxData == NULL) || (Size == 0U))
    {
        errorcode = HAL_ERROR;
        goto error;
    }

    /* Don't overwrite in case of HAL_SPI_STATE_BUSY_RX */
    if (hspi->State != HAL_SPI_STATE_BUSY_RX)
    {
        hspi->State = HAL_SPI_STATE_BUSY_TX_RX;
    }

    /* Set the transaction information */
    hspi->ErrorCode   = HAL_SPI_ERROR_NONE;
    hspi->pTxBuffPtr  = (uint8_t *)pTxData;
    hspi->TxXferSize  = Size;
    hspi->TxXferCount = Size;
    hspi->pRxBuffPtr  = (uint8_t *)pRxData;
    hspi->RxXferSize  = Size;
    hspi->RxXferCount = Size;

    /* Init field not used in handle to zero */
    hspi->RxISR       = NULL;
    hspi->TxISR       = NULL;

#if (USE_SPI_CRC != 0U)
    /* Reset CRC Calculation */
    if (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLE)
    {
        SPI_RESET_CRC(hspi);
    }
#endif /* USE_SPI_CRC */

    /* Reset the threshold bit */
//  CLEAR_BIT(hspi->Instance->CR2, SPI_CR2_LDMATX | SPI_CR2_LDMARX);

    /* The packing mode management is enabled by the DMA settings according the spi data size */
    if (hspi->Init.DataSize > SPI_DATASIZE_8BIT)
    {
        /* Set fiforxthreshold according the reception data length: 16bit */
        CLEAR_BIT(hspi->Instance->CR2, SPI_RXFIFO_THRESHOLD);
    }
    else
    {
        /* Set RX Fifo threshold according the reception data length: 8bit */
        SET_BIT(hspi->Instance->CR2, SPI_RXFIFO_THRESHOLD);

        if (hspi->hdmatx->Init.MemDataAlignment == DMA_MDATAALIGN_HALFWORD)
        {
            if ((hspi->TxXferSize & 0x1U) == 0x0U)
            {
//        CLEAR_BIT(hspi->Instance->CR2, SPI_CR2_LDMATX);
                hspi->TxXferCount = hspi->TxXferCount >> 1U;
            }
            else
            {
//        SET_BIT(hspi->Instance->CR2, SPI_CR2_LDMATX);
                hspi->TxXferCount = (hspi->TxXferCount >> 1U) + 1U;
            }
        }

