sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_spi.c
        if (hspi->hdmarx->Init.MemDataAlignment == DMA_MDATAALIGN_HALFWORD)
        {
            /* Set RX Fifo threshold according the reception data length: 16bit */
            CLEAR_BIT(hspi->Instance->CR2, SPI_RXFIFO_THRESHOLD);

            if ((hspi->RxXferCount & 0x1U) == 0x0U)
            {
//       CLEAR_BIT(hspi->Instance->CR2, SPI_CR2_LDMARX);
                hspi->RxXferCount = hspi->RxXferCount >> 1U;
            }
            else
            {
//        SET_BIT(hspi->Instance->CR2, SPI_CR2_LDMARX);
                hspi->RxXferCount = (hspi->RxXferCount >> 1U) + 1U;
            }
        }
    }

    /* Check if we are in Rx only or in Rx/Tx Mode and configure the DMA transfer complete callback */
    if (hspi->State == HAL_SPI_STATE_BUSY_RX)
    {
        /* Set the SPI Rx DMA Half transfer complete callback */
        hspi->hdmarx->XferHalfCpltCallback = SPI_DMAHalfReceiveCplt;
        hspi->hdmarx->XferCpltCallback     = SPI_DMAReceiveCplt;
    }
    else
    {
        /* Set the SPI Tx/Rx DMA Half transfer complete callback */
        hspi->hdmarx->XferHalfCpltCallback = SPI_DMAHalfTransmitReceiveCplt;
        hspi->hdmarx->XferCpltCallback     = SPI_DMATransmitReceiveCplt;
    }

    /* Set the DMA error callback */
    hspi->hdmarx->XferErrorCallback = SPI_DMAError;

    /* Set the DMA AbortCpltCallback */
    hspi->hdmarx->XferAbortCallback = NULL;

    /* Enable the Rx DMA Stream/Channel  */
    if (HAL_OK != HAL_DMA_Start_IT(hspi->hdmarx, (uint32_t)&hspi->Instance->DR, (uint32_t)hspi->pRxBuffPtr,
                                   hspi->RxXferCount))
    {
        /* Update SPI error code */
        SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_DMA);
        errorcode = HAL_ERROR;

        hspi->State = HAL_SPI_STATE_READY;
        goto error;
    }

    /* Enable Rx DMA Request */
    SET_BIT(hspi->Instance->CR2, SPI_CR2_RXDMAEN);

    /* Set the SPI Tx DMA transfer complete callback as NULL because the communication closing
    is performed in DMA reception complete callback  */
    hspi->hdmatx->XferHalfCpltCallback = NULL;
    hspi->hdmatx->XferCpltCallback     = NULL;
    hspi->hdmatx->XferErrorCallback    = NULL;
    hspi->hdmatx->XferAbortCallback    = NULL;

    /* Enable the Tx DMA Stream/Channel  */
    if (HAL_OK != HAL_DMA_Start_IT(hspi->hdmatx, (uint32_t)hspi->pTxBuffPtr, (uint32_t)&hspi->Instance->DR,
                                   hspi->TxXferCount))
    {
        /* Update SPI error code */
        SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_DMA);
        errorcode = HAL_ERROR;

        hspi->State = HAL_SPI_STATE_READY;
        goto error;
    }

    /* Check if the SPI is already enabled */
    if ((hspi->Instance->CR1 & SPI_CR1_SPE) != SPI_CR1_SPE)
    {
        /* Enable SPI peripheral */
        __HAL_SPI_ENABLE(hspi);
    }
    /* Enable the SPI Error Interrupt Bit */
    __HAL_SPI_ENABLE_IT(hspi, (SPI_IT_ERR));

    /* Enable Tx DMA Request */
    SET_BIT(hspi->Instance->CR2, SPI_CR2_TXDMAEN);

error :
    /* Process Unlocked */
    __HAL_UNLOCK(hspi);
    return errorcode;
}

/**
  * @brief  Abort ongoing transfer (blocking mode).
  * @param  hspi SPI handle.
  * @note   This procedure could be used for aborting any ongoing transfer (Tx and Rx),
  *         started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable SPI Interrupts (depending of transfer direction)
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort (in case of transfer in DMA mode)
  *           - Set handle State to READY
  * @note   This procedure is executed in blocking mode : when exiting function, Abort is considered as completed.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SPI_Abort(SPI_HandleTypeDef *hspi)
{
    HAL_StatusTypeDef errorcode;
    __IO uint32_t count;
    __IO uint32_t resetcount;

    /* Initialized local variable  */
    errorcode = HAL_OK;
    resetcount = SPI_DEFAULT_TIMEOUT * (SystemCoreClock / 24U / 1000U);
    count = resetcount;

    /* Clear ERRIE interrupt to avoid error interrupts generation during Abort procedure */
    CLEAR_BIT(hspi->Instance->CR2, SPI_CR2_ERRIE);

    /* Disable TXEIE, RXNEIE and ERRIE(mode fault event, overrun error, TI frame error) interrupts */
    if (HAL_IS_BIT_SET(hspi->Instance->CR2, SPI_CR2_TXEIE))
    {
        hspi->TxISR = SPI_AbortTx_ISR;
        /* Wait HAL_SPI_STATE_ABORT state */
        do
        {
            if (count == 0U)
            {
                SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_ABORT);
                break;
            }
            count--;
        } while (hspi->State != HAL_SPI_STATE_ABORT);
        /* Reset Timeout Counter */
        count = resetcount;
    }

    if (HAL_IS_BIT_SET(hspi->Instance->CR2, SPI_CR2_RXNEIE))
    {
        hspi->RxISR = SPI_AbortRx_ISR;
        /* Wait HAL_SPI_STATE_ABORT state */
        do
        {
            if (count == 0U)
            {
                SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_ABORT);
                break;
            }
            count--;
        } while (hspi->State != HAL_SPI_STATE_ABORT);
        /* Reset Timeout Counter */
        count = resetcount;
    }

    /* Disable the SPI DMA Tx request if enabled */
    if (HAL_IS_BIT_SET(hspi->Instance->CR2, SPI_CR2_TXDMAEN))
    {
        /* Abort the SPI DMA Tx Stream/Channel : use blocking DMA Abort API (no callback) */
        if (hspi->hdmatx != NULL)
        {
            /* Set the SPI DMA Abort callback :
            will lead to call HAL_SPI_AbortCpltCallback() at end of DMA abort procedure */
            hspi->hdmatx->XferAbortCallback = NULL;

            /* Abort DMA Tx Handle linked to SPI Peripheral */
            if (HAL_DMA_Abort(hspi->hdmatx) != HAL_OK)
            {
                hspi->ErrorCode = HAL_SPI_ERROR_ABORT;
            }

            /* Disable Tx DMA Request */
            CLEAR_BIT(hspi->Instance->CR2, (SPI_CR2_TXDMAEN));

