sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_spi.c
            if (SPI_EndRxTxTransaction(hspi, SPI_DEFAULT_TIMEOUT, HAL_GetTick()) != HAL_OK)
            {
                hspi->ErrorCode = HAL_SPI_ERROR_ABORT;
            }

            /* Disable SPI Peripheral */
            __HAL_SPI_DISABLE(hspi);

            /* Empty the FRLVL fifo */
            if (SPI_WaitFifoStateUntilTimeout(hspi, SPI_FLAG_FRLVL, SPI_FRLVL_EMPTY, SPI_DEFAULT_TIMEOUT, HAL_GetTick()) != HAL_OK)
            {
                hspi->ErrorCode = HAL_SPI_ERROR_ABORT;
            }
        }
    }

    /* Disable the SPI DMA Rx request if enabled */
    if (HAL_IS_BIT_SET(hspi->Instance->CR2, SPI_CR2_RXDMAEN))
    {
        /* Abort the SPI DMA Rx Stream/Channel : use blocking DMA Abort API (no callback) */
        if (hspi->hdmarx != NULL)
        {
            /* Set the SPI DMA Abort callback :
            will lead to call HAL_SPI_AbortCpltCallback() at end of DMA abort procedure */
            hspi->hdmarx->XferAbortCallback = NULL;

            /* Abort DMA Rx Handle linked to SPI Peripheral */
            if (HAL_DMA_Abort(hspi->hdmarx) != HAL_OK)
            {
                hspi->ErrorCode = HAL_SPI_ERROR_ABORT;
            }

            /* Disable peripheral */
            __HAL_SPI_DISABLE(hspi);

            /* Control the BSY flag */
            if (SPI_WaitFlagStateUntilTimeout(hspi, SPI_FLAG_BSY, RESET, SPI_DEFAULT_TIMEOUT, HAL_GetTick()) != HAL_OK)
            {
                hspi->ErrorCode = HAL_SPI_ERROR_ABORT;
            }

            /* Empty the FRLVL fifo */
            if (SPI_WaitFifoStateUntilTimeout(hspi, SPI_FLAG_FRLVL, SPI_FRLVL_EMPTY, SPI_DEFAULT_TIMEOUT, HAL_GetTick()) != HAL_OK)
            {
                hspi->ErrorCode = HAL_SPI_ERROR_ABORT;
            }

            /* Disable Rx DMA Request */
            CLEAR_BIT(hspi->Instance->CR2, (SPI_CR2_RXDMAEN));
        }
    }
    /* Reset Tx and Rx transfer counters */
    hspi->RxXferCount = 0U;
    hspi->TxXferCount = 0U;

    /* Check error during Abort procedure */
    if (hspi->ErrorCode == HAL_SPI_ERROR_ABORT)
    {
        /* return HAL_Error in case of error during Abort procedure */
        errorcode = HAL_ERROR;
    }
    else
    {
        /* Reset errorCode */
        hspi->ErrorCode = HAL_SPI_ERROR_NONE;
    }

    /* Clear the Error flags in the SR register */
    __HAL_SPI_CLEAR_OVRFLAG(hspi);
    __HAL_SPI_CLEAR_FREFLAG(hspi);

    /* Restore hspi->state to ready */
    hspi->State = HAL_SPI_STATE_READY;

    return errorcode;
}

/**
  * @brief  Abort ongoing transfer (Interrupt mode).
  * @param  hspi SPI handle.
  * @note   This procedure could be used for aborting any ongoing transfer (Tx and Rx),
  *         started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable SPI Interrupts (depending of transfer direction)
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort_IT (in case of transfer in DMA mode)
  *           - Set handle State to READY
  *           - At abort completion, call user abort complete callback
  * @note   This procedure is executed in Interrupt mode, meaning that abort procedure could be
  *         considered as completed only when user abort complete callback is executed (not when exiting function).
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SPI_Abort_IT(SPI_HandleTypeDef *hspi)
{
    HAL_StatusTypeDef errorcode;
    uint32_t abortcplt ;
    __IO uint32_t count;
    __IO uint32_t resetcount;

    /* Initialized local variable  */
    errorcode = HAL_OK;
    abortcplt = 1U;
    resetcount = SPI_DEFAULT_TIMEOUT * (SystemCoreClock / 24U / 1000U);
    count = resetcount;

    /* Clear ERRIE interrupt to avoid error interrupts generation during Abort procedure */
    CLEAR_BIT(hspi->Instance->CR2, SPI_CR2_ERRIE);

    /* Change Rx and Tx Irq Handler to Disable TXEIE, RXNEIE and ERRIE interrupts */
    if (HAL_IS_BIT_SET(hspi->Instance->CR2, SPI_CR2_TXEIE))
    {
        hspi->TxISR = SPI_AbortTx_ISR;
        /* Wait HAL_SPI_STATE_ABORT state */
        do
        {
            if (count == 0U)
            {
                SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_ABORT);
                break;
            }
            count--;
        } while (hspi->State != HAL_SPI_STATE_ABORT);
        /* Reset Timeout Counter */
        count = resetcount;
    }

    if (HAL_IS_BIT_SET(hspi->Instance->CR2, SPI_CR2_RXNEIE))
    {
        hspi->RxISR = SPI_AbortRx_ISR;
        /* Wait HAL_SPI_STATE_ABORT state */
        do
        {
            if (count == 0U)
            {
                SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_ABORT);
                break;
            }
            count--;
        } while (hspi->State != HAL_SPI_STATE_ABORT);
        /* Reset Timeout Counter */
        count = resetcount;
    }

    /* If DMA Tx and/or DMA Rx Handles are associated to SPI Handle, DMA Abort complete callbacks should be initialised
       before any call to DMA Abort functions */
    /* DMA Tx Handle is valid */
    if (hspi->hdmatx != NULL)
    {
        /* Set DMA Abort Complete callback if UART DMA Tx request if enabled.
           Otherwise, set it to NULL */
        if (HAL_IS_BIT_SET(hspi->Instance->CR2, SPI_CR2_TXDMAEN))
        {
            hspi->hdmatx->XferAbortCallback = SPI_DMATxAbortCallback;
        }
        else
        {
            hspi->hdmatx->XferAbortCallback = NULL;
        }
    }
    /* DMA Rx Handle is valid */
    if (hspi->hdmarx != NULL)
    {
        /* Set DMA Abort Complete callback if UART DMA Rx request if enabled.
           Otherwise, set it to NULL */
        if (HAL_IS_BIT_SET(hspi->Instance->CR2, SPI_CR2_RXDMAEN))
        {
            hspi->hdmarx->XferAbortCallback = SPI_DMARxAbortCallback;
        }
        else
        {
            hspi->hdmarx->XferAbortCallback = NULL;
        }
    }

    /* Disable the SPI DMA Tx request if enabled */
    if (HAL_IS_BIT_SET(hspi->Instance->CR2, SPI_CR2_TXDMAEN))
    {
        /* Abort the SPI DMA Tx Stream/Channel */
        if (hspi->hdmatx != NULL)
        {
            /* Abort DMA Tx Handle linked to SPI Peripheral */
            if (HAL_DMA_Abort_IT(hspi->hdmatx) != HAL_OK)
            {
                hspi->hdmatx->XferAbortCallback = NULL;
                hspi->ErrorCode = HAL_SPI_ERROR_ABORT;
            }
            else
            {
                abortcplt = 0U;
            }
        }
    }
    /* Disable the SPI DMA Rx request if enabled */
    if (HAL_IS_BIT_SET(hspi->Instance->CR2, SPI_CR2_RXDMAEN))
    {
        /* Abort the SPI DMA Rx Stream/Channel */
        if (hspi->hdmarx != NULL)
        {
            /* Abort DMA Rx Handle linked to SPI Peripheral */
            if (HAL_DMA_Abort_IT(hspi->hdmarx) !=  HAL_OK)
            {
                hspi->hdmarx->XferAbortCallback = NULL;
                hspi->ErrorCode = HAL_SPI_ERROR_ABORT;
            }
            else
            {
                abortcplt = 0U;
            }
        }
    }

    if (abortcplt == 1U)
    {
        /* Reset Tx and Rx transfer counters */
        hspi->RxXferCount = 0U;
        hspi->TxXferCount = 0U;

        /* Check error during Abort procedure */
        if (hspi->ErrorCode == HAL_SPI_ERROR_ABORT)
        {
            /* return HAL_Error in case of error during Abort procedure */
            errorcode = HAL_ERROR;
        }
        else
        {
            /* Reset errorCode */
            hspi->ErrorCode = HAL_SPI_ERROR_NONE;
        }

