sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_spi.c
        /* Clear the Error flags in the SR register */
        __HAL_SPI_CLEAR_OVRFLAG(hspi);
        __HAL_SPI_CLEAR_FREFLAG(hspi);

        /* Restore hspi->State to Ready */
        hspi->State = HAL_SPI_STATE_READY;

        /* As no DMA to be aborted, call directly user Abort complete callback */
#if (USE_HAL_SPI_REGISTER_CALLBACKS == 1U)
        hspi->AbortCpltCallback(hspi);
#else
        HAL_SPI_AbortCpltCallback(hspi);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
    }

    return errorcode;
}

/**
  * @brief  Pause the DMA Transfer.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for the specified SPI module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SPI_DMAPause(SPI_HandleTypeDef *hspi)
{
    /* Process Locked */
    __HAL_LOCK(hspi);

    /* Disable the SPI DMA Tx & Rx requests */
    CLEAR_BIT(hspi->Instance->CR2, SPI_CR2_TXDMAEN | SPI_CR2_RXDMAEN);

    /* Process Unlocked */
    __HAL_UNLOCK(hspi);

    return HAL_OK;
}

/**
  * @brief  Resume the DMA Transfer.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for the specified SPI module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SPI_DMAResume(SPI_HandleTypeDef *hspi)
{
    /* Process Locked */
    __HAL_LOCK(hspi);

    /* Enable the SPI DMA Tx & Rx requests */
    SET_BIT(hspi->Instance->CR2, SPI_CR2_TXDMAEN | SPI_CR2_RXDMAEN);

    /* Process Unlocked */
    __HAL_UNLOCK(hspi);

    return HAL_OK;
}

/**
  * @brief  Stop the DMA Transfer.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for the specified SPI module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SPI_DMAStop(SPI_HandleTypeDef *hspi)
{
    HAL_StatusTypeDef errorcode = HAL_OK;
    /* The Lock is not implemented on this API to allow the user application
       to call the HAL SPI API under callbacks HAL_SPI_TxCpltCallback() or HAL_SPI_RxCpltCallback() or HAL_SPI_TxRxCpltCallback():
       when calling HAL_DMA_Abort() API the DMA TX/RX Transfer complete interrupt is generated
       and the correspond call back is executed HAL_SPI_TxCpltCallback() or HAL_SPI_RxCpltCallback() or HAL_SPI_TxRxCpltCallback()
       */

    /* Abort the SPI DMA tx Stream/Channel  */
    if (hspi->hdmatx != NULL)
    {
        if (HAL_OK != HAL_DMA_Abort(hspi->hdmatx))
        {
            SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_DMA);
            errorcode = HAL_ERROR;
        }
    }
    /* Abort the SPI DMA rx Stream/Channel  */
    if (hspi->hdmarx != NULL)
    {
        if (HAL_OK != HAL_DMA_Abort(hspi->hdmarx))
        {
            SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_DMA);
            errorcode = HAL_ERROR;
        }
    }

    /* Disable the SPI DMA Tx & Rx requests */
    CLEAR_BIT(hspi->Instance->CR2, SPI_CR2_TXDMAEN | SPI_CR2_RXDMAEN);
    hspi->State = HAL_SPI_STATE_READY;
    return errorcode;
}

/**
  * @brief  Handle SPI interrupt request.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for the specified SPI module.
  * @retval None
  */
void HAL_SPI_IRQHandler(SPI_HandleTypeDef *hspi)
{
    uint32_t itsource = hspi->Instance->CR2;
    uint32_t itflag   = hspi->Instance->SR;

    /* SPI in mode Receiver ----------------------------------------------------*/
    if ((SPI_CHECK_FLAG(itflag, SPI_FLAG_OVR) == RESET) &&
            (SPI_CHECK_FLAG(itflag, SPI_FLAG_RXNE) != RESET) && (SPI_CHECK_IT_SOURCE(itsource, SPI_IT_RXNE) != RESET))
    {
        hspi->RxISR(hspi);
        return;
    }

    /* SPI in mode Transmitter -------------------------------------------------*/
    if ((SPI_CHECK_FLAG(itflag, SPI_FLAG_TXE) != RESET) && (SPI_CHECK_IT_SOURCE(itsource, SPI_IT_TXE) != RESET))
    {
        hspi->TxISR(hspi);
        return;
    }

    /* SPI in Error Treatment --------------------------------------------------*/
    if (((SPI_CHECK_FLAG(itflag, SPI_FLAG_MODF) != RESET) || (SPI_CHECK_FLAG(itflag, SPI_FLAG_OVR) != RESET))&& (SPI_CHECK_IT_SOURCE(itsource, SPI_IT_ERR) != RESET))
        //|| (SPI_CHECK_FLAG(itflag, SPI_FLAG_FRE) != RESET)) && (SPI_CHECK_IT_SOURCE(itsource, SPI_IT_ERR) != RESET))

    {
        /* SPI Overrun error interrupt occurred ----------------------------------*/
        if (SPI_CHECK_FLAG(itflag, SPI_FLAG_OVR) != RESET)
        {
            if (hspi->State != HAL_SPI_STATE_BUSY_TX)
            {
                SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_OVR);
                __HAL_SPI_CLEAR_OVRFLAG(hspi);
            }
            else
            {
                __HAL_SPI_CLEAR_OVRFLAG(hspi);
                return;
            }
        }

        /* SPI Mode Fault error interrupt occurred -------------------------------*/
        if (SPI_CHECK_FLAG(itflag, SPI_FLAG_MODF) != RESET)
        {
            SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_MODF);
            __HAL_SPI_CLEAR_MODFFLAG(hspi);
        }

//    /* SPI Frame error interrupt occurred ------------------------------------*/
//    if (SPI_CHECK_FLAG(itflag, SPI_FLAG_FRE) != RESET)
//    {
//      SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_FRE);
//      __HAL_SPI_CLEAR_FREFLAG(hspi);
//    }

        if (hspi->ErrorCode != HAL_SPI_ERROR_NONE)
        {
            /* Disable all interrupts */
            __HAL_SPI_DISABLE_IT(hspi, SPI_IT_RXNE | SPI_IT_TXE | SPI_IT_ERR);

            hspi->State = HAL_SPI_STATE_READY;
            /* Disable the SPI DMA requests if enabled */
            if ((HAL_IS_BIT_SET(itsource, SPI_CR2_TXDMAEN)) || (HAL_IS_BIT_SET(itsource, SPI_CR2_RXDMAEN)))
            {
                CLEAR_BIT(hspi->Instance->CR2, (SPI_CR2_TXDMAEN | SPI_CR2_RXDMAEN));

                /* Abort the SPI DMA Rx channel */
                if (hspi->hdmarx != NULL)
                {
                    /* Set the SPI DMA Abort callback :
                    will lead to call HAL_SPI_ErrorCallback() at end of DMA abort procedure */
                    hspi->hdmarx->XferAbortCallback = SPI_DMAAbortOnError;
                    if (HAL_OK != HAL_DMA_Abort_IT(hspi->hdmarx))
                    {
                        SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_ABORT);
                    }
                }
                /* Abort the SPI DMA Tx channel */
                if (hspi->hdmatx != NULL)
                {
                    /* Set the SPI DMA Abort callback :
                    will lead to call HAL_SPI_ErrorCallback() at end of DMA abort procedure */
                    hspi->hdmatx->XferAbortCallback = SPI_DMAAbortOnError;
                    if (HAL_OK != HAL_DMA_Abort_IT(hspi->hdmatx))
                    {
                        SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_ABORT);
                    }
                }
            }
            else
            {
                /* Call user error callback */
#if (USE_HAL_SPI_REGISTER_CALLBACKS == 1U)
                hspi->ErrorCallback(hspi);
#else
                HAL_SPI_ErrorCallback(hspi);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
            }
        }
        return;
    }
}

/**
  * @brief  Tx Transfer completed callback.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
__weak void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hspi);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_SPI_TxCpltCallback should be implemented in the user file
     */
}

/**
  * @brief  Rx Transfer completed callback.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
__weak void HAL_SPI_RxCpltCallback(SPI_HandleTypeDef *hspi)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hspi);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_SPI_RxCpltCallback should be implemented in the user file
     */
}

/**
  * @brief  Tx and Rx Transfer completed callback.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
__weak void HAL_SPI_TxRxCpltCallback(SPI_HandleTypeDef *hspi)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hspi);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_SPI_TxRxCpltCallback should be implemented in the user file
     */
}

/**
  * @brief  Tx Half Transfer completed callback.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
__weak void HAL_SPI_TxHalfCpltCallback(SPI_HandleTypeDef *hspi)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hspi);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_SPI_TxHalfCpltCallback should be implemented in the user file
     */
}

/**
  * @brief  Rx Half Transfer completed callback.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
__weak void HAL_SPI_RxHalfCpltCallback(SPI_HandleTypeDef *hspi)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hspi);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_SPI_RxHalfCpltCallback() should be implemented in the user file
     */
}

/**
  * @brief  Tx and Rx Half Transfer callback.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
__weak void HAL_SPI_TxRxHalfCpltCallback(SPI_HandleTypeDef *hspi)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hspi);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_SPI_TxRxHalfCpltCallback() should be implemented in the user file
     */
}

/**
  * @brief  SPI error callback.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
__weak void HAL_SPI_ErrorCallback(SPI_HandleTypeDef *hspi)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hspi);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_SPI_ErrorCallback should be implemented in the user file
     */
    /* NOTE : The ErrorCode parameter in the hspi handle is updated by the SPI processes
              and user can use HAL_SPI_GetError() API to check the latest error occurred
     */
}

/**
  * @brief  SPI Abort Complete callback.
  * @param  hspi SPI handle.
  * @retval None
  */
__weak void HAL_SPI_AbortCpltCallback(SPI_HandleTypeDef *hspi)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hspi);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_SPI_AbortCpltCallback can be implemented in the user file.
     */
}

/**
  * @}
  */

/** @defgroup SPI_Exported_Functions_Group3 Peripheral State and Errors functions
  * @brief   SPI control functions
  *
@verbatim
 ===============================================================================
                      ##### Peripheral State and Errors functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to control the SPI.
     (+) HAL_SPI_GetState() API can be helpful to check in run-time the state of the SPI peripheral
     (+) HAL_SPI_GetError() check in run-time Errors occurring during communication
@endverbatim
  * @{
  */

/**
  * @brief  Return the SPI handle state.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval SPI state
  */
HAL_SPI_StateTypeDef HAL_SPI_GetState(SPI_HandleTypeDef *hspi)
{
    /* Return SPI handle state */
    return hspi->State;
}

/**
  * @brief  Return the SPI error code.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval SPI error code in bitmap format
  */
uint32_t HAL_SPI_GetError(SPI_HandleTypeDef *hspi)
{
    /* Return SPI ErrorCode */
    return hspi->ErrorCode;
}

/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup SPI_Private_Functions
  * @brief   Private functions
  * @{
  */

/**
  * @brief  DMA SPI transmit process complete callback.
  * @param  hdma pointer to a DMA_HandleTypeDef structure that contains
  *               the configuration information for the specified DMA module.
  * @retval None
  */
static void SPI_DMATransmitCplt(DMA_HandleTypeDef *hdma)
{
    SPI_HandleTypeDef *hspi = (SPI_HandleTypeDef *)(((DMA_HandleTypeDef *)hdma)->Parent); /* Derogation MISRAC2012-Rule-11.5 */
    uint32_t tickstart;

    /* Init tickstart for timeout management*/
    tickstart = HAL_GetTick();

