sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_spi.c
    /* DMA Normal Mode */
    if ((hdma->Instance->CCR & DMA_CCR_CIRC) != DMA_CCR_CIRC)
    {
        /* Disable ERR interrupt */
        __HAL_SPI_DISABLE_IT(hspi, SPI_IT_ERR);

        /* Disable Tx DMA Request */
        CLEAR_BIT(hspi->Instance->CR2, SPI_CR2_TXDMAEN);

        /* Check the end of the transaction */
        if (SPI_EndRxTxTransaction(hspi, SPI_DEFAULT_TIMEOUT, tickstart) != HAL_OK)
        {
            SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_FLAG);
        }

        /* Clear overrun flag in 2 Lines communication mode because received data is not read */
        if (hspi->Init.Direction == SPI_DIRECTION_2LINES)
        {
            __HAL_SPI_CLEAR_OVRFLAG(hspi);
        }

        hspi->TxXferCount = 0U;
        hspi->State = HAL_SPI_STATE_READY;

        if (hspi->ErrorCode != HAL_SPI_ERROR_NONE)
        {
            /* Call user error callback */
#if (USE_HAL_SPI_REGISTER_CALLBACKS == 1U)
            hspi->ErrorCallback(hspi);
#else
            HAL_SPI_ErrorCallback(hspi);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
            return;
        }
    }
    /* Call user Tx complete callback */
#if (USE_HAL_SPI_REGISTER_CALLBACKS == 1U)
    hspi->TxCpltCallback(hspi);
#else
    HAL_SPI_TxCpltCallback(hspi);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA SPI receive process complete callback.
  * @param  hdma pointer to a DMA_HandleTypeDef structure that contains
  *               the configuration information for the specified DMA module.
  * @retval None
  */
static void SPI_DMAReceiveCplt(DMA_HandleTypeDef *hdma)
{
    SPI_HandleTypeDef *hspi = (SPI_HandleTypeDef *)(((DMA_HandleTypeDef *)hdma)->Parent); /* Derogation MISRAC2012-Rule-11.5 */
    uint32_t tickstart;

    /* Init tickstart for timeout management*/
    tickstart = HAL_GetTick();

    /* DMA Normal Mode */
    if ((hdma->Instance->CCR & DMA_CCR_CIRC) != DMA_CCR_CIRC)
    {
        /* Disable ERR interrupt */
        __HAL_SPI_DISABLE_IT(hspi, SPI_IT_ERR);

#if (USE_SPI_CRC != 0U)
        /* CRC handling */
        if (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLE)
        {
            /* Wait until RXNE flag */
            if (SPI_WaitFlagStateUntilTimeout(hspi, SPI_FLAG_RXNE, SET, SPI_DEFAULT_TIMEOUT, tickstart) != HAL_OK)
            {
                /* Error on the CRC reception */
                SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_CRC);
            }
            /* Read CRC */
            if (hspi->Init.DataSize > SPI_DATASIZE_8BIT)
            {
                /* Read 16bit CRC */
                READ_REG(hspi->Instance->DR);
            }
            else
            {
                /* Read 8bit CRC */
                READ_REG(*(__IO uint8_t *)&hspi->Instance->DR);

                if (hspi->Init.CRCLength == SPI_CRC_LENGTH_16BIT)
                {
                    if (SPI_WaitFlagStateUntilTimeout(hspi, SPI_FLAG_RXNE, SET, SPI_DEFAULT_TIMEOUT, tickstart) != HAL_OK)
                    {
                        /* Error on the CRC reception */
                        SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_CRC);
                    }
                    /* Read 8bit CRC again in case of 16bit CRC in 8bit Data mode */
                    READ_REG(*(__IO uint8_t *)&hspi->Instance->DR);
                }
            }
        }
#endif /* USE_SPI_CRC */

        /* Disable Rx/Tx DMA Request (done by default to handle the case master rx direction 2 lines) */
        CLEAR_BIT(hspi->Instance->CR2, SPI_CR2_TXDMAEN | SPI_CR2_RXDMAEN);

        /* Check the end of the transaction */
        if (SPI_EndRxTransaction(hspi, SPI_DEFAULT_TIMEOUT, tickstart) != HAL_OK)
        {
            hspi->ErrorCode = HAL_SPI_ERROR_FLAG;
        }

        hspi->RxXferCount = 0U;
        hspi->State = HAL_SPI_STATE_READY;

#if (USE_SPI_CRC != 0U)
        /* Check if CRC error occurred */
        if (__HAL_SPI_GET_FLAG(hspi, SPI_FLAG_CRCERR))
        {
            SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_CRC);
            __HAL_SPI_CLEAR_CRCERRFLAG(hspi);
        }
#endif /* USE_SPI_CRC */

        if (hspi->ErrorCode != HAL_SPI_ERROR_NONE)
        {
            /* Call user error callback */
#if (USE_HAL_SPI_REGISTER_CALLBACKS == 1U)
            hspi->ErrorCallback(hspi);
#else
            HAL_SPI_ErrorCallback(hspi);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
            return;
        }
    }
    /* Call user Rx complete callback */
#if (USE_HAL_SPI_REGISTER_CALLBACKS == 1U)
    hspi->RxCpltCallback(hspi);
#else
    HAL_SPI_RxCpltCallback(hspi);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA SPI transmit receive process complete callback.
  * @param  hdma pointer to a DMA_HandleTypeDef structure that contains
  *               the configuration information for the specified DMA module.
  * @retval None
  */
static void SPI_DMATransmitReceiveCplt(DMA_HandleTypeDef *hdma)
{
    SPI_HandleTypeDef *hspi = (SPI_HandleTypeDef *)(((DMA_HandleTypeDef *)hdma)->Parent); /* Derogation MISRAC2012-Rule-11.5 */
    uint32_t tickstart;

    /* Init tickstart for timeout management*/
    tickstart = HAL_GetTick();

    /* DMA Normal Mode */
    if ((hdma->Instance->CCR & DMA_CCR_CIRC) != DMA_CCR_CIRC)
    {
        /* Disable ERR interrupt */
        __HAL_SPI_DISABLE_IT(hspi, SPI_IT_ERR);

#if (USE_SPI_CRC != 0U)
        /* CRC handling */
        if (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLE)
        {
            if ((hspi->Init.DataSize == SPI_DATASIZE_8BIT) && (hspi->Init.CRCLength == SPI_CRC_LENGTH_8BIT))
            {
                if (SPI_WaitFifoStateUntilTimeout(hspi, SPI_FLAG_FRLVL, SPI_FRLVL_QUARTER_FULL, SPI_DEFAULT_TIMEOUT,
                                                  tickstart) != HAL_OK)
                {
                    /* Error on the CRC reception */
                    SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_CRC);
                }
                /* Read CRC to Flush DR and RXNE flag */
                READ_REG(*(__IO uint8_t *)&hspi->Instance->DR);
            }
            else
            {
                if (SPI_WaitFifoStateUntilTimeout(hspi, SPI_FLAG_FRLVL, SPI_FRLVL_HALF_FULL, SPI_DEFAULT_TIMEOUT, tickstart) != HAL_OK)
                {
                    /* Error on the CRC reception */
                    SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_CRC);
                }
                /* Read CRC to Flush DR and RXNE flag */
                READ_REG(hspi->Instance->DR);
            }
        }
#endif /* USE_SPI_CRC */

