sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_spi.c
    /* Check no error during Abort procedure */
    if (hspi->ErrorCode != HAL_SPI_ERROR_ABORT)
    {
        /* Reset errorCode */
        hspi->ErrorCode = HAL_SPI_ERROR_NONE;
    }

    /* Clear the Error flags in the SR register */
    __HAL_SPI_CLEAR_OVRFLAG(hspi);
    __HAL_SPI_CLEAR_FREFLAG(hspi);

    /* Restore hspi->State to Ready */
    hspi->State  = HAL_SPI_STATE_READY;

    /* Call user Abort complete callback */
#if (USE_HAL_SPI_REGISTER_CALLBACKS == 1U)
    hspi->AbortCpltCallback(hspi);
#else
    HAL_SPI_AbortCpltCallback(hspi);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA SPI Rx communication abort callback, when initiated by user
  *         (To be called at end of DMA Rx Abort procedure following user abort request).
  * @note   When this callback is executed, User Abort complete call back is called only if no
  *         Abort still ongoing for Tx DMA Handle.
  * @param  hdma DMA handle.
  * @retval None
  */
static void SPI_DMARxAbortCallback(DMA_HandleTypeDef *hdma)
{
    SPI_HandleTypeDef *hspi = (SPI_HandleTypeDef *)(((DMA_HandleTypeDef *)hdma)->Parent); /* Derogation MISRAC2012-Rule-11.5 */

    /* Disable SPI Peripheral */
    __HAL_SPI_DISABLE(hspi);

    hspi->hdmarx->XferAbortCallback = NULL;

    /* Disable Rx DMA Request */
    CLEAR_BIT(hspi->Instance->CR2, SPI_CR2_RXDMAEN);

    /* Control the BSY flag */
    if (SPI_WaitFlagStateUntilTimeout(hspi, SPI_FLAG_BSY, RESET, SPI_DEFAULT_TIMEOUT, HAL_GetTick()) != HAL_OK)
    {
        hspi->ErrorCode = HAL_SPI_ERROR_ABORT;
    }

    /* Empty the FRLVL fifo */
    if (SPI_WaitFifoStateUntilTimeout(hspi, SPI_FLAG_FRLVL, SPI_FRLVL_EMPTY, SPI_DEFAULT_TIMEOUT, HAL_GetTick()) != HAL_OK)
    {
        hspi->ErrorCode = HAL_SPI_ERROR_ABORT;
    }

    /* Check if an Abort process is still ongoing */
    if (hspi->hdmatx != NULL)
    {
        if (hspi->hdmatx->XferAbortCallback != NULL)
        {
            return;
        }
    }

    /* No Abort process still ongoing : All DMA Stream/Channel are aborted, call user Abort Complete callback */
    hspi->RxXferCount = 0U;
    hspi->TxXferCount = 0U;

    /* Check no error during Abort procedure */
    if (hspi->ErrorCode != HAL_SPI_ERROR_ABORT)
    {
        /* Reset errorCode */
        hspi->ErrorCode = HAL_SPI_ERROR_NONE;
    }

    /* Clear the Error flags in the SR register */
    __HAL_SPI_CLEAR_OVRFLAG(hspi);
    __HAL_SPI_CLEAR_FREFLAG(hspi);

    /* Restore hspi->State to Ready */
    hspi->State  = HAL_SPI_STATE_READY;

    /* Call user Abort complete callback */
#if (USE_HAL_SPI_REGISTER_CALLBACKS == 1U)
    hspi->AbortCpltCallback(hspi);
#else
    HAL_SPI_AbortCpltCallback(hspi);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
}

/**
  * @brief  Rx 8-bit handler for Transmit and Receive in Interrupt mode.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
static void SPI_2linesRxISR_8BIT(struct __SPI_HandleTypeDef *hspi)
{
    /* Receive data in packing mode */
    if (hspi->RxXferCount > 1U)
    {
        *((uint16_t *)hspi->pRxBuffPtr) = (uint16_t)(hspi->Instance->DR);
        hspi->pRxBuffPtr += sizeof(uint16_t);
        hspi->RxXferCount -= 2U;
        if (hspi->RxXferCount == 1U)
        {
            /* Set RX Fifo threshold according the reception data length: 8bit */
            SET_BIT(hspi->Instance->CR2, SPI_RXFIFO_THRESHOLD);
        }
    }
    /* Receive data in 8 Bit mode */
    else
    {
        *hspi->pRxBuffPtr = *((__IO uint8_t *)&hspi->Instance->DR);
        hspi->pRxBuffPtr++;
        hspi->RxXferCount--;
    }

    /* Check end of the reception */
    if (hspi->RxXferCount == 0U)
    {
#if (USE_SPI_CRC != 0U)
        if (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLE)
        {
            SET_BIT(hspi->Instance->CR2, SPI_RXFIFO_THRESHOLD);
            hspi->RxISR =  SPI_2linesRxISR_8BITCRC;
            return;
        }
#endif /* USE_SPI_CRC */

        /* Disable RXNE  and ERR interrupt */
        __HAL_SPI_DISABLE_IT(hspi, (SPI_IT_RXNE | SPI_IT_ERR));

        if (hspi->TxXferCount == 0U)
        {
            SPI_CloseRxTx_ISR(hspi);
        }
    }
}

#if (USE_SPI_CRC != 0U)
/**
  * @brief  Rx 8-bit handler for Transmit and Receive in Interrupt mode.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
static void SPI_2linesRxISR_8BITCRC(struct __SPI_HandleTypeDef *hspi)
{
    /* Read 8bit CRC to flush Data Regsiter */
    READ_REG(*(__IO uint8_t *)&hspi->Instance->DR);

    hspi->CRCSize--;

    /* Check end of the reception */
    if (hspi->CRCSize == 0U)
    {
        /* Disable RXNE and ERR interrupt */
        __HAL_SPI_DISABLE_IT(hspi, (SPI_IT_RXNE | SPI_IT_ERR));

        if (hspi->TxXferCount == 0U)
        {
            SPI_CloseRxTx_ISR(hspi);
        }
    }
}
#endif /* USE_SPI_CRC */

/**
  * @brief  Tx 8-bit handler for Transmit and Receive in Interrupt mode.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
static void SPI_2linesTxISR_8BIT(struct __SPI_HandleTypeDef *hspi)
{
    /* Transmit data in packing Bit mode */
    if (hspi->TxXferCount >= 2U)
    {
        hspi->Instance->DR = *((uint16_t *)hspi->pTxBuffPtr);
        hspi->pTxBuffPtr += sizeof(uint16_t);
        hspi->TxXferCount -= 2U;
    }
    /* Transmit data in 8 Bit mode */
    else
    {
        *(__IO uint8_t *)&hspi->Instance->DR = (*hspi->pTxBuffPtr);
        hspi->pTxBuffPtr++;
        hspi->TxXferCount--;
    }

    /* Check the end of the transmission */
    if (hspi->TxXferCount == 0U)
    {
#if (USE_SPI_CRC != 0U)
        if (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLE)
        {
            /* Set CRC Next Bit to send CRC */
            SET_BIT(hspi->Instance->CR1, SPI_CR1_CRCNEXT);
            /* Disable TXE interrupt */
            __HAL_SPI_DISABLE_IT(hspi, SPI_IT_TXE);
            return;
        }
#endif /* USE_SPI_CRC */

        /* Disable TXE interrupt */
        __HAL_SPI_DISABLE_IT(hspi, SPI_IT_TXE);

        if (hspi->RxXferCount == 0U)
        {
            SPI_CloseRxTx_ISR(hspi);
        }
    }
}

/**
  * @brief  Rx 16-bit handler for Transmit and Receive in Interrupt mode.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
static void SPI_2linesRxISR_16BIT(struct __SPI_HandleTypeDef *hspi)
{
    /* Receive data in 16 Bit mode */
    *((uint16_t *)hspi->pRxBuffPtr) = (uint16_t)(hspi->Instance->DR);
    hspi->pRxBuffPtr += sizeof(uint16_t);
    hspi->RxXferCount--;

    if (hspi->RxXferCount == 0U)
    {
#if (USE_SPI_CRC != 0U)
        if (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLE)
        {
            hspi->RxISR =  SPI_2linesRxISR_16BITCRC;
            return;
        }
#endif /* USE_SPI_CRC */

        /* Disable RXNE interrupt */
        __HAL_SPI_DISABLE_IT(hspi, SPI_IT_RXNE);

        if (hspi->TxXferCount == 0U)
        {
            SPI_CloseRxTx_ISR(hspi);
        }
    }
}

#if (USE_SPI_CRC != 0U)
/**
  * @brief  Manage the CRC 16-bit receive for Transmit and Receive in Interrupt mode.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
static void SPI_2linesRxISR_16BITCRC(struct __SPI_HandleTypeDef *hspi)
{
    /* Read 16bit CRC to flush Data Regsiter */
    READ_REG(hspi->Instance->DR);

    /* Disable RXNE interrupt */
    __HAL_SPI_DISABLE_IT(hspi, SPI_IT_RXNE);

    SPI_CloseRxTx_ISR(hspi);
}
#endif /* USE_SPI_CRC */

/**
  * @brief  Tx 16-bit handler for Transmit and Receive in Interrupt mode.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
static void SPI_2linesTxISR_16BIT(struct __SPI_HandleTypeDef *hspi)
{
    /* Transmit data in 16 Bit mode */
    hspi->Instance->DR = *((uint16_t *)hspi->pTxBuffPtr);
    hspi->pTxBuffPtr += sizeof(uint16_t);
    hspi->TxXferCount--;

    /* Enable CRC Transmission */
    if (hspi->TxXferCount == 0U)
    {
#if (USE_SPI_CRC != 0U)
        if (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLE)
        {
            /* Set CRC Next Bit to send CRC */
            SET_BIT(hspi->Instance->CR1, SPI_CR1_CRCNEXT);
            /* Disable TXE interrupt */
            __HAL_SPI_DISABLE_IT(hspi, SPI_IT_TXE);
            return;
        }
#endif /* USE_SPI_CRC */

        /* Disable TXE interrupt */
        __HAL_SPI_DISABLE_IT(hspi, SPI_IT_TXE);

        if (hspi->RxXferCount == 0U)
        {
            SPI_CloseRxTx_ISR(hspi);
        }
    }
}

#if (USE_SPI_CRC != 0U)
/**
  * @brief  Manage the CRC 8-bit receive in Interrupt context.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
static void SPI_RxISR_8BITCRC(struct __SPI_HandleTypeDef *hspi)
{
    /* Read 8bit CRC to flush Data Register */
    READ_REG(*(__IO uint8_t *)&hspi->Instance->DR);

    hspi->CRCSize--;

    if (hspi->CRCSize == 0U)
    {
        SPI_CloseRx_ISR(hspi);
    }
}
#endif /* USE_SPI_CRC */

/**
  * @brief  Manage the receive 8-bit in Interrupt context.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
static void SPI_RxISR_8BIT(struct __SPI_HandleTypeDef *hspi)
{
    *hspi->pRxBuffPtr = (*(__IO uint8_t *)&hspi->Instance->DR);
    hspi->pRxBuffPtr++;
    hspi->RxXferCount--;

#if (USE_SPI_CRC != 0U)
    /* Enable CRC Transmission */
    if ((hspi->RxXferCount == 1U) && (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLE))
    {
        SET_BIT(hspi->Instance->CR1, SPI_CR1_CRCNEXT);
    }
#endif /* USE_SPI_CRC */

    if (hspi->RxXferCount == 0U)
    {
#if (USE_SPI_CRC != 0U)
        if (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLE)
        {
            hspi->RxISR =  SPI_RxISR_8BITCRC;
            return;
        }
#endif /* USE_SPI_CRC */
        SPI_CloseRx_ISR(hspi);
    }
}

#if (USE_SPI_CRC != 0U)
/**
  * @brief  Manage the CRC 16-bit receive in Interrupt context.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
static void SPI_RxISR_16BITCRC(struct __SPI_HandleTypeDef *hspi)
{
    /* Read 16bit CRC to flush Data Register */
    READ_REG(hspi->Instance->DR);

