sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_spi.c
    /* Disable RXNE and ERR interrupt */
    __HAL_SPI_DISABLE_IT(hspi, (SPI_IT_RXNE | SPI_IT_ERR));

    SPI_CloseRx_ISR(hspi);
}
#endif /* USE_SPI_CRC */

/**
  * @brief  Manage the 16-bit receive in Interrupt context.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
static void SPI_RxISR_16BIT(struct __SPI_HandleTypeDef *hspi)
{
    *((uint16_t *)hspi->pRxBuffPtr) = (uint16_t)(hspi->Instance->DR);
    hspi->pRxBuffPtr += sizeof(uint16_t);
    hspi->RxXferCount--;

#if (USE_SPI_CRC != 0U)
    /* Enable CRC Transmission */
    if ((hspi->RxXferCount == 1U) && (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLE))
    {
        SET_BIT(hspi->Instance->CR1, SPI_CR1_CRCNEXT);
    }
#endif /* USE_SPI_CRC */

    if (hspi->RxXferCount == 0U)
    {
#if (USE_SPI_CRC != 0U)
        if (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLE)
        {
            hspi->RxISR = SPI_RxISR_16BITCRC;
            return;
        }
#endif /* USE_SPI_CRC */
        SPI_CloseRx_ISR(hspi);
    }
}

/**
  * @brief  Handle the data 8-bit transmit in Interrupt mode.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
static void SPI_TxISR_8BIT(struct __SPI_HandleTypeDef *hspi)
{
    *(__IO uint8_t *)&hspi->Instance->DR = (*hspi->pTxBuffPtr);
    hspi->pTxBuffPtr++;
    hspi->TxXferCount--;

    if (hspi->TxXferCount == 0U)
    {
#if (USE_SPI_CRC != 0U)
        if (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLE)
        {
            /* Enable CRC Transmission */
            SET_BIT(hspi->Instance->CR1, SPI_CR1_CRCNEXT);
        }
#endif /* USE_SPI_CRC */
        SPI_CloseTx_ISR(hspi);
    }
}

/**
  * @brief  Handle the data 16-bit transmit in Interrupt mode.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
static void SPI_TxISR_16BIT(struct __SPI_HandleTypeDef *hspi)
{
    /* Transmit data in 16 Bit mode */
    hspi->Instance->DR = *((uint16_t *)hspi->pTxBuffPtr);
    hspi->pTxBuffPtr += sizeof(uint16_t);
    hspi->TxXferCount--;

    if (hspi->TxXferCount == 0U)
    {
#if (USE_SPI_CRC != 0U)
        if (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLE)
        {
            /* Enable CRC Transmission */
            SET_BIT(hspi->Instance->CR1, SPI_CR1_CRCNEXT);
        }
#endif /* USE_SPI_CRC */
        SPI_CloseTx_ISR(hspi);
    }
}

/**
  * @brief  Handle SPI Communication Timeout.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *              the configuration information for SPI module.
  * @param  Flag SPI flag to check
  * @param  State flag state to check
  * @param  Timeout Timeout duration
  * @param  Tickstart tick start value
  * @retval HAL status
  */
static HAL_StatusTypeDef SPI_WaitFlagStateUntilTimeout(SPI_HandleTypeDef *hspi, uint32_t Flag, FlagStatus State,
        uint32_t Timeout, uint32_t Tickstart)
{
    while ((__HAL_SPI_GET_FLAG(hspi, Flag) ? SET : RESET) != State)
    {
        if (Timeout != HAL_MAX_DELAY)
        {
            if (((HAL_GetTick() - Tickstart) >= Timeout) || (Timeout == 0U))
            {
                /* Disable the SPI and reset the CRC: the CRC value should be cleared
                on both master and slave sides in order to resynchronize the master
                and slave for their respective CRC calculation */

                /* Disable TXE, RXNE and ERR interrupts for the interrupt process */
                __HAL_SPI_DISABLE_IT(hspi, (SPI_IT_TXE | SPI_IT_RXNE | SPI_IT_ERR));

                if ((hspi->Init.Mode == SPI_MODE_MASTER) && ((hspi->Init.Direction == SPI_DIRECTION_1LINE)
                        || (hspi->Init.Direction == SPI_DIRECTION_2LINES_RXONLY)))
                {
                    /* Disable SPI peripheral */
                    __HAL_SPI_DISABLE(hspi);
                }

//        /* Reset CRC Calculation */
//        if (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLE)
//        {
//          SPI_RESET_CRC(hspi);
//        }

                hspi->State = HAL_SPI_STATE_READY;

                /* Process Unlocked */
                __HAL_UNLOCK(hspi);

                return HAL_TIMEOUT;
            }
        }
    }

    return HAL_OK;
}

/**
  * @brief  Handle SPI FIFO Communication Timeout.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *              the configuration information for SPI module.
  * @param  Fifo Fifo to check
  * @param  State Fifo state to check
  * @param  Timeout Timeout duration
  * @param  Tickstart tick start value
  * @retval HAL status
  */
static HAL_StatusTypeDef SPI_WaitFifoStateUntilTimeout(SPI_HandleTypeDef *hspi, uint32_t Fifo, uint32_t State,
        uint32_t Timeout, uint32_t Tickstart)
{
    while ((hspi->Instance->SR & Fifo) != State)
    {
        if ((Fifo == SPI_SR_FRLVL) && (State == SPI_FRLVL_EMPTY))
        {
            /* Read 8bit CRC to flush Data Register */
            READ_REG(*((__IO uint8_t *)&hspi->Instance->DR));
        }

        if (Timeout != HAL_MAX_DELAY)
        {
            if (((HAL_GetTick() - Tickstart) >= Timeout) || (Timeout == 0U))
            {
                /* Disable the SPI and reset the CRC: the CRC value should be cleared
                   on both master and slave sides in order to resynchronize the master
                   and slave for their respective CRC calculation */

                /* Disable TXE, RXNE and ERR interrupts for the interrupt process */
                __HAL_SPI_DISABLE_IT(hspi, (SPI_IT_TXE | SPI_IT_RXNE | SPI_IT_ERR));

                if ((hspi->Init.Mode == SPI_MODE_MASTER) && ((hspi->Init.Direction == SPI_DIRECTION_1LINE)
                        || (hspi->Init.Direction == SPI_DIRECTION_2LINES_RXONLY)))
                {
                    /* Disable SPI peripheral */
                    __HAL_SPI_DISABLE(hspi);
                }

//        /* Reset CRC Calculation */
//        if (hspi->Init.CRCCalculation == SPI_CRCCALCULATION_ENABLE)
//        {
//          SPI_RESET_CRC(hspi);
//        }

                hspi->State = HAL_SPI_STATE_READY;

                /* Process Unlocked */
                __HAL_UNLOCK(hspi);

