sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_spi.c
    /* Disable TXE and ERR interrupt */
    __HAL_SPI_DISABLE_IT(hspi, (SPI_IT_TXE | SPI_IT_ERR));

    /* Check the end of the transaction */
    if (SPI_EndRxTxTransaction(hspi, SPI_DEFAULT_TIMEOUT, tickstart) != HAL_OK)
    {
        SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_FLAG);
    }

    /* Clear overrun flag in 2 Lines communication mode because received is not read */
    if (hspi->Init.Direction == SPI_DIRECTION_2LINES)
    {
        __HAL_SPI_CLEAR_OVRFLAG(hspi);
    }

    hspi->State = HAL_SPI_STATE_READY;
    if (hspi->ErrorCode != HAL_SPI_ERROR_NONE)
    {
        /* Call user error callback */
#if (USE_HAL_SPI_REGISTER_CALLBACKS == 1U)
        hspi->ErrorCallback(hspi);
#else
        HAL_SPI_ErrorCallback(hspi);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
    }
    else
    {
        /* Call user Rx complete callback */
#if (USE_HAL_SPI_REGISTER_CALLBACKS == 1U)
        hspi->TxCpltCallback(hspi);
#else
        HAL_SPI_TxCpltCallback(hspi);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
    }
}

/**
  * @brief  Handle abort a Rx transaction.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
static void SPI_AbortRx_ISR(SPI_HandleTypeDef *hspi)
{
    __IO uint32_t count;

    /* Disable SPI Peripheral */
    __HAL_SPI_DISABLE(hspi);

    count = SPI_DEFAULT_TIMEOUT * (SystemCoreClock / 24U / 1000U);

    /* Disable RXNEIE interrupt */
    CLEAR_BIT(hspi->Instance->CR2, (SPI_CR2_RXNEIE));

    /* Check RXNEIE is disabled */
    do
    {
        if (count == 0U)
        {
            SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_ABORT);
            break;
        }
        count--;
    } while (HAL_IS_BIT_SET(hspi->Instance->CR2, SPI_CR2_RXNEIE));

    /* Control the BSY flag */
    if (SPI_WaitFlagStateUntilTimeout(hspi, SPI_FLAG_BSY, RESET, SPI_DEFAULT_TIMEOUT, HAL_GetTick()) != HAL_OK)
    {
        hspi->ErrorCode = HAL_SPI_ERROR_ABORT;
    }

    /* Empty the FRLVL fifo */
    if (SPI_WaitFifoStateUntilTimeout(hspi, SPI_FLAG_FRLVL, SPI_FRLVL_EMPTY, SPI_DEFAULT_TIMEOUT, HAL_GetTick()) != HAL_OK)
    {
        hspi->ErrorCode = HAL_SPI_ERROR_ABORT;
    }

    hspi->State = HAL_SPI_STATE_ABORT;
}

/**
  * @brief  Handle abort a Tx or Rx/Tx transaction.
  * @param  hspi pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
static void SPI_AbortTx_ISR(SPI_HandleTypeDef *hspi)
{
    __IO uint32_t count;

    count = SPI_DEFAULT_TIMEOUT * (SystemCoreClock / 24U / 1000U);

    /* Disable TXEIE interrupt */
    CLEAR_BIT(hspi->Instance->CR2, (SPI_CR2_TXEIE));

    /* Check TXEIE is disabled */
    do
    {
        if (count == 0U)
        {
            SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_ABORT);
            break;
        }
        count--;
    } while (HAL_IS_BIT_SET(hspi->Instance->CR2, SPI_CR2_TXEIE));

    if (SPI_EndRxTxTransaction(hspi, SPI_DEFAULT_TIMEOUT, HAL_GetTick()) != HAL_OK)
    {
        hspi->ErrorCode = HAL_SPI_ERROR_ABORT;
    }

    /* Disable SPI Peripheral */
    __HAL_SPI_DISABLE(hspi);

    /* Empty the FRLVL fifo */
    if (SPI_WaitFifoStateUntilTimeout(hspi, SPI_FLAG_FRLVL, SPI_FRLVL_EMPTY, SPI_DEFAULT_TIMEOUT, HAL_GetTick()) != HAL_OK)
    {
        hspi->ErrorCode = HAL_SPI_ERROR_ABORT;
    }

    /* Check case of Full-Duplex Mode and disable directly RXNEIE interrupt */
    if (HAL_IS_BIT_SET(hspi->Instance->CR2, SPI_CR2_RXNEIE))
    {
        /* Disable RXNEIE interrupt */
        CLEAR_BIT(hspi->Instance->CR2, (SPI_CR2_RXNEIE));

        /* Check RXNEIE is disabled */
        do
        {
            if (count == 0U)
            {
                SET_BIT(hspi->ErrorCode, HAL_SPI_ERROR_ABORT);
                break;
            }
            count--;
        } while (HAL_IS_BIT_SET(hspi->Instance->CR2, SPI_CR2_RXNEIE));

        /* Control the BSY flag */
        if (SPI_WaitFlagStateUntilTimeout(hspi, SPI_FLAG_BSY, RESET, SPI_DEFAULT_TIMEOUT, HAL_GetTick()) != HAL_OK)
        {
            hspi->ErrorCode = HAL_SPI_ERROR_ABORT;
        }

        /* Empty the FRLVL fifo */
        if (SPI_WaitFifoStateUntilTimeout(hspi, SPI_FLAG_FRLVL, SPI_FRLVL_EMPTY, SPI_DEFAULT_TIMEOUT, HAL_GetTick()) != HAL_OK)
        {
            hspi->ErrorCode = HAL_SPI_ERROR_ABORT;
        }
    }
    hspi->State = HAL_SPI_STATE_ABORT;
}

/**
  * @}
  */

#endif /* HAL_SPI_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT Puya *****END OF FILE****/
